HW2/rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 26 Oct 2013 22:55:52 UTC +00:00], ["description", nil], ["rating", nil], ["release_date", nil], ["title", nil], ["updated_at", Sat, 26 Oct 2013 22:55:52 UTC +00:00]]
---
  def create
    @movie = Movie.create!(params[:movie])